app/Controllers/AuthController.php

    public function login()
    {
        if ($this->request->getPost()) {
            $rules = [
                'username' => 'required|min_length[6]',
                'password' => 'required|min_length[7]|numeric',
            ];

            if ($this->validate($rules)) {
                $username = $this->request->getVar('username');
                $password = $this->request->getVar('password');

                $dataUser = $this->userModel ->where(['username' => $username])->first();
---
SELECT *
FROM `user`
WHERE `username` = 'yani71'
AND `user`.`deleted_at` IS NULL
 LIMIT 1