app/Controllers/Home.php

    public function index(): string
    {
        $products = $this->productModel->findAll();
---
SELECT *
FROM `product`
WHERE `product`.`deleted_at` IS NULL