app/Controllers/TransaksiController.php

    public function history()
    {
        $username = session()->get('username');

        $transactions = $this->transactionModel->where('username', $username)->findAll();
---
SELECT *
FROM `transaction`
WHERE `username` = 'roniakb'
AND `transaction`.`deleted_at` IS NULL